chamber_movingwall/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformNormalFixedValue;
        uniformValue    constant -0.35;
        value           $internalField;
    }
    outlet
    {
        type            inletoutlet;
        inletvalue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    rotor
    {
        type            rotatingwallvelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           constant 104.72;    // 1000rpm
    }
    "wall.*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
